
var documents = [{
    "id": 0,
    "url": "/404.html",
    "title": "404",
    "body": "404 Page not found!Please use the search bar from the bottom left or visit our homepage! "
    }, {
    "id": 1,
    "url": "/about",
    "title": "君子藏器于身，待时而动。",
    "body": "Hey 👋🏽, I’m Evan Donn! 一个说宅不宅的技术小青年，有着一颗想览尽世间好应用、好套路、好文章、好书籍、好思想的贪婪心。 经常会被好看的网站或者应用吸引，没有美感却偏偏想要做出一些美的东西。捣鼓过各种平台技术各种主题博客，虽然 wordpress 依然实用，但看好jamstack发展方向，gatsby 做博客就很不错。沉迷 Ant Design–起码外行的我看起来觉得他们的设计体系是很酷很棒的！ MAC OS爱好者，效率控、软件控。当然了，无聊的国产电视剧也深得我心。 一些点  👨🏽‍💻 西厂后端开发工程师一枚; 🌱 Java、python、些许前端技能; 🤔 正在努力打怪搬砖; 💬 欢迎交流人生难题，给予指导。; 📫 绿码: itakeall42; 📝 暂不找工作~个人经历  now : working in 西厂 17 年跟 zack 和 isa 运营公众号IT派以及尝试做一个国内的fiverr（斜杠派）。 18 年开发医疗肿瘤相关的应用后台小刘医生、电视台新闻后台自然语言处理项目。 19 年杭州蘑菇街实习，商品相关需求实现。"
    }, {
    "id": 2,
    "url": "/categories",
    "title": "Categories",
    "body": ""
    }, {
    "id": 3,
    "url": "/contact",
    "title": "Contact",
    "body": "  Please send your message to {{site. name}}. We will reply as soon as possible!   "
    }, {
    "id": 4,
    "url": "/",
    "title": "Home",
    "body": "  {% for post in paginator. posts %}    {% include postbox. html %}  {% endfor %}  {% include pagination. html %}"
    }, {
    "id": 5,
    "url": "/robots.txt",
    "title": "",
    "body": "      Sitemap: {{ “sitemap. xml”   absolute_url }}   "
    }, {
    "id": 6,
    "url": "/page2/",
    "title": "Home",
    "body": "  {% for post in paginator. posts %}    {% include postbox. html %}  {% endfor %}  {% include pagination. html %}"
    }, {
    "id": 7,
    "url": "/%E6%9D%82%E8%B0%88-%E5%86%99%E5%9C%A8%E5%B7%A5%E4%BD%9C%E4%B8%80%E5%B9%B4%E4%B9%8B%E9%99%85/",
    "title": "杂谈 | 写在工作一年之际",
    "body": "2021/06/14 -  当你老了，回顾一生，就会发觉：什么时候出国读书，什么时候决定做第一份职业、何时选定了对象而恋爱、什么时候结婚，其实都是命运的巨变。只是当时站在三岔路口，眼见风云千樯，你作出选择的那一日，在日记上，相当沉闷和平凡，当时还以为是生命中普通的一天。 前言: 有大半年没有写blog了，看出来并没有持续不断的自我审视。这半年过得一般，人的记忆总是短暂的，或许已经忘记了最忙碌的时候，最迷惘的时候，最有压迫感的时候，似乎再让我重头来一次，依然会同样的措手不及。 这大半年大致分为3个阶段吧：  独立负责一块业务每天担负着老应用的迁移下线的压力以及业务未来发展方向的思考，很有压迫感，倒不是说最忙，而是花了大量的时间去尝试控制自己无法控制的事，这段时间算是很考验心力的一段时间，按理说这段时间是我能不断巩固拓展其他实力的时间。 – 没有生活主线 第二个阶段就是进入忙碌无止尽的设计讨论另外一块跟资金相关的业务了，这段时间最大的感受就是决策前充分讨论，决策后坚决执行。虽然大家都是秉着道理二字来沟通，但是还是有很多决策是由权力制定的。虽然也有很多低效的沟通，但是自己又没能有此时此刻，非我莫属的担当，拿出更好的方案。 – 生活的主线是工作 第三个阶段就是业务上线之后了，突如其来的流量，前期所有的小问题瞬间被放大。就像是一个小兵对着坦克一样，毫无战斗力，靠人工去处理工单，解决问题。今天发现问题，明天就发布。这样的节奏让人窒息，就像乱扑火一样，这里补一下，那里补一下，同样的没有此时此刻非我莫属的担当，很明显人力不够，节奏该放慢，但是给出去的承诺，唯有靠团队极强的个人能力来不断前行。 – 千里之堤毁于蚁穴。总的来说，这半年得失兼备，只有不断去经历去体验才能明白每一个分岔路口的选择。 关于理财: 说来惭愧，工作一年了，存下的钱竟然就是公积金里面的钱，买可乐是不会买穷人的，吃饭是吃不穷人的，看电影是看不穷人的，那么问题来了？钱都去哪了？ 正当准备重整旗鼓新的一年好好攒钱的时候，劳动节感受了一把人性的修罗场：币圈。我曾对自己的定义是保守、沉着、冷静。但终究还是抵不过人性的弱点，那办个小时，身体的滚烫凭借着2天的观望，一顿操作9000u直接全军覆没，期间不断倒腾的币也无希望，此战大败。所幸，当时的我也只有9000u了，这算是人生中宝贵的一课，也是最昂贵的一课了。那句人总是赚不到你认知外的钱是没有说错的，那种FOMO(Fear of missing out)的感觉是不可取的，那种眼红着别人闲鱼翻身也是不可取的，从理性分析能从这个修罗场上获得好处的人几乎是比中彩票的概率还低，凭什么是你呢？对于我来说，什么时候孤注一掷都是错误的选择。我并没有完全失去所有，有一份工作，有一个和谐的家庭，有还过得去的生活，没有必要孤注一掷，我要做的是step by step 等待着那个甜蜜的球就好了。新一年的理财规划那就是还是要着眼于生活中的每一笔收支，不到必要的时候不要用花呗和借呗，要有利息的意识，万分之几的叠加是很要命的。望，两周年之际能凑个小小小房子的首付。 关于成长: 要说这半年的成长，那还是自己以往的老样子，总是喜欢铺开面，再深入到点。如果说T字型人才，那我总是喜欢先把那一横操办了，然后再找到那一竖不断深入。要说未来那一竖，我看到了有2个的方向可选择：  individual contributor（独立贡献者）：在团队里面成为那一个技术大神，扫地僧的角色，类似多隆一样，在一个方向上是高精尖的。但似乎这个方向于我而言有点远，第一份工作让我的着力点就不在于去不断追新，这个估计会是自己那一横的厚度吧。 manager的角色：这个方向相对靠谱一些，但是我离manager还有非常长的一段路，对人性的认识以及将领的那种杀伐决断是我十分确实的特质。但是我觉得自己身上的共情能力是能让团队和谐的比较独特的点，希望自己能基于这一点去扩散深入自己的能力。无论哪一个方向未来2年最重要的策略还是不断去经历更多的事，更多的项目，更多的领域，磨炼自己的品性，在这个过程中不断去领悟自己的人生。在软件开发这条路上不断定义问题-&gt;学习新知识—&gt;解决问题。具体的roadmap就不在这里贴了，还是希望未来一年要开始磨炼自己的竖的能力。 关于技术: 这一年技术上似乎真的是荒废了很多，leetcode没有如当初设想那样去坚持训练保持问题-&gt;代码实现的能力。最近知道了刷leetcode算是一种kata练习，是鲍勃大叔这个有着很高职业素养的选手都会去做的事，不断保持手感。但是在业务能力上有了一种新的认识，自己也算有过独立开发者、创业公司的开发者、中型公司的开发者、大型公司的开发者这几种不同的体验吧。 独立开发者：当年还年轻，总是想着用酷炫的技术，用一把非常热的名词（spring cloud 微服务 前后端分离）等来实现技术，这种经历往往是不计成本也不求商业回报的，但凡当初起了商业回报的念头，那失落感必定是满满的。 初创业公司的开发者：这种环境一般懂技术的一般也是没有，你说什么就是什么，当时也同样的是以尝试新技术的思路来开发的，现在回想起来要是当初有现在的业务sense也不至于一直在背后写那么多无用的代码。 中型公司开发者：以实习生的身份，就不妄论了。有基本的基础设施了，但仍然还是需要关心点底层实现。 大型公司开发者：那简直就是各种基础设施齐全，机器不用自己去阿里云购买、ci、cd不用自己操心配、负载均衡、监控、链路排查、项目管理都是一应齐全，虽然不是最顶级的，但都有。这就导致了一个问题是“存储不值钱”、“定时任务直接解耦掉好了”、“离线存储做好了”… 类似的话语滔滔不绝，但其实这样的决策在超大规模业务的时候必定会成为一种负担，但他确实是当前业务的最佳选择。总的一句就是：没有机会接触需要在技术上工匠之心的业务，这就让技术方面的思考少了一些，但是在技术赋能业务、技术对组织、技术与协同方面有了更多的思考。这些思考似乎是每个中型公司规模不断壮大必将遇到的问题，每个处于类似困境的业务都需要这种决策的经验什么时候平台化？什么时候这个业务该有什么样的技术选型？有什么的产品形态？追求的是什么？ 所以呢，一言以蔽之，当初入职之初设立的mysql深入、redis深入、并发深入自然是没有很好的进展的，因为时间都用来思考其他方面的事情了。最快的学习方法就是有一个命题给到自己，我很赞同学以致用，虽然自己没有特意去学习那些技术，但是每一次用到这些技术的时候，自己都会深入看一步，比如：  mysql json字段存储最大长度是如何的？公司dba默认设置是多少？ 对应慢查询的sql要怎么优化掉？ 代码中分布式锁的实现用的是redis的什么能力？有什么别的可以选择的吗？今天学会了一个词，叫小胜负，未来一年希望自己能有更多这样的小胜负，每次有机会的时候积累一点，相信未来总会用得上。 关于生活: 过去一年去了青岛、去了杭州这边的丽水、乌镇、金华、义务、上海这些地方，身体虽然在路上，但似乎并没有好好的去享受那每一个时光，心中始终有着牵挂未能放开自己好好的去体验当地的风土人情。 同时入职之初给自己立的做饭falg、摄影flag、平面设计flag、开发一个app的flag、拍摄vlog的flag倒得不省人事，唯一没有倒得一个flag是过去一年没有生病。 在4月份的时候，tl跟我说要找到除工作之外的生活的兴趣并能持续为之投入时间，能让自己愉悦的事情。似乎还是没能找到，每周的生活大概就是电视剧、电影陪我度过，但愿新的一年有些不一样吧。 关于未来: 希望新的一年工作上能拿到好的结果，生活上的flag至少不要倒完，技术上能精进到自信决策，钱一定要存到小目标！！！ "
    }, {
    "id": 8,
    "url": "/%E6%9D%82%E8%B0%88-%E5%86%99%E5%9C%A8%E9%9D%92%E5%B2%9B%E4%B9%8B%E6%97%85%E5%90%8E/",
    "title": "杂谈 | 写在青岛之旅后",
    "body": "2020/10/06 - 看到了什么:  看似无人的小店，里面却热火朝天，份量很足的各种小吃。 不慌不忙的生活，佛系的经营，惬意的喝着酒，吃着花生，高壮帅的年轻人。 许多家庭出游，也有本地居民的出行，和父母一起出行 有的地方滴滴是真的难打车，出租车还是主流，手动挡也是主流 有些地铁站的人流是真的少 去各景点拍婚纱照的人是真的多 . . 总的来说就是，给我的那种感觉像极了在沈阳生活的那段日子，建筑风格，生活节奏，人文气息，就是不知道就业环境如何。 想到了什么:  想过些慢节奏的惬意生活，互联网时代，能否隐居这样的城市之中远程参与这个世界的节奏？ 想赚一线城市的钱，过二三线城市的生活 想回家乡做建设了0 0，可能是受到了《我和我的家乡》《一点到家》这两个电影的影响 未来怎么样: Settle down life，think about dream，find a direction，work hard for it! "
    }, {
    "id": 9,
    "url": "/%E6%9D%82%E8%B0%88-%E5%86%99%E5%9C%A8%E8%AF%95%E7%94%A8%E6%9C%9F%E9%80%9A%E8%BF%87%E5%90%8E/",
    "title": "杂谈 | 写在试用期通过后",
    "body": "2020/09/29 - “XXX你好，恭喜你成功通过试用期，祝你在接下来的工作中一切顺利。” 比我预期的时间要早了15天，也意味着我接下来要承担更多的责任，负责更多的事情了，其实这两天也挺迷茫的，似乎挡在前面这堵墙倒了，看不到下一堵墙在哪？亟需我在内心进行一番重整，告诉自己What’s next ? 感受最深的3点是什么？:  在阿里的同学，真的是从上到下都顶着巨大的精神压力，方向明确的顶着压力，方向不明确的顶着压力，各方的目标不一致的，更要顶着压力拿到结果，一个人要承担多个角色的职责，这也在不断push着大家成长。 工作之后的生活真的难以把控，跟学校相比而言，工作中有了更多的不确定性，更多的波动因子，要如何才能将这些波动变成常态，并能找到自己的方向和正轨坚持，需要摸索。 同事们是真的优秀，每个人身上都有着自己独特的特点，我渴望像他们一样拥有这灵动的大脑，能言善辩，或许只有经历了才会有用吧，我也逐渐明白了zack那种天然的老板气质，管理者的凛飒。能做得更好的地方？:  生活是不是可以更严格些？生活节奏控得更死，对自己工作之外的目标更hard？ 节奏转换点是不是能更优雅?个人成长在哪里？:  技能提升：以图表义、浓缩提炼、文字表达、问题提问、ppt、功在平时 视野提升：比实现更重要的往往是背后的why？做每件事之前一定要问清楚why，能够说服自己、优秀人的做事风格、思维方式。What’s next ?: 如果说终态结果？那就定一个两年内升6！朝着下一个层级飞跃。  掌握一套正确的思辨思维，磨炼自己的眼光和洞察力，为以后自己决策做铺垫 掌握个人表达软技能，总结思考能力 // todo"
    }, {
    "id": 10,
    "url": "/%E6%9C%AA%E7%94%9F-%E6%9C%89%E6%84%9F/",
    "title": "杂谈 | 《未生》每个应届毕业的人都该看一看",
    "body": "2020/09/05 -  “世界上只有一种真正的英雄主义，那就是在认清生活的真相后依然热爱生活。” – 罗曼罗兰 未生，是韩国在围棋中的专业术语，指围棋中的最后一步棋，却有起死回生的机会，是目前还无法存活下来的棋子，像男主张格莱这样的，就叫未生，必须时刻努力，否则无法存活。完生，棋子有两个眼的就是活棋。吴科长这样的在职场摸爬滚打很多年的 可以说已经适应职场，了解人情世故的，则是完生。虽然初入职场的同学都该看一看这一部韩剧，但事实上，如果面向未来思考的话，职场中任何人都该看一看，因为每一个人都随时可能被踢出局，所以也是在拼命挣扎。这一点我在阿里有着切身的体会，P8、P9又如何，肩上一样负担着许多的焦虑和不安，也在接受者生活和工作对他们的考验。 总结感悟: 我也总能在脉脉和牛客网上看到类似剧中的现象：  有的师兄觉得新人太高傲了，总觉得自己了不起，想要表现自己，不懂得做人 有的师兄觉得新人太笨了，什么问题都要问他，自己还要被倒挂 有的师兄觉得新人太不自信了，什么都不敢问，不敢说，不懂表现自己的想法和观点 有的新人觉得师兄很菜，主管很菜，自己很厉害，却不被重视 有的新人觉得师兄和主管是在pua他，是在坑他 …. 如果说我是什么个情况？那我大概是有点男主的内敛，有点男三的小聪明，有男主和男二那样的好师兄好主管，他们鼓励我，给我机会表达和锻炼自己，磨炼我的心志，用最近主管说的一句话就是：借事修人，借假修真。其实我内心是不笃定的，因为职场确实就是职场，每个人有每个人自己的生活，没有人有义务和责任来真心对你，但是不管怎么样，作为新人，我认为一定要有发现亮点的眼睛，任何工作，任何内容，总能对你带来帮助，一定要想清楚自己的目标，你要什么？你准备付出什么去获得？至于值不值得，能不能得到，那就是一个需要不断深思的过程了。去悟，去思考，去行动。 人物画像:  男主-张克莱: 男主以高中毕业的文凭进入了一家大公司，开始受到了许多的质疑，但凭借着他的努力和他在围棋中悟到的一些道理和准则，逐渐能胜任工作。虽然他对公司政治以及人情世故十分的不敏感，但也正是他这种凭着在围棋中的一些准则，坚持做自己认为对的事情，最终也获得了他的上司以及代理（理解为师傅）认可。优势：冷静、打破常规、懂得举一反三（围棋中的道理能很好运用到生活中）、勤奋劣势：不懂得如何与人打交道、固执、不懂政治 女主-安英依: 实习的时候能得心应手，但是正式入职之后被分配到一个新的组，这个组内对女性极不友好，让她的才华无法得以施展，但是她忍辱负重，应了那句“君子藏器于身，待时而动。”最终证明了自己的能力，也逐渐适应起了工作。优势：多技能、工作能力强劣势：被分配到了不好的组 男二-张百基: 实习的时候也是个人物，好胜心很强，自诩学历背景很好，所以总是嫉妒男主。正式入职之后，不理解师兄对他的栽培，一度想要跳槽，但在师兄的教导下，最终慢慢上手，学会了报告写作一些基本功，慢慢胜任更重要的工作。优势：学历背景、专业素质硬（相当于985 211高校毕业的高材生）劣势：自傲、自大、觉得自己很强应该被委以重任 男三-韩锡律: 有很多想法，有着小聪明的乐观社交好手。优点：能说会道、八面玲珑、忍辱负重劣势：浮于表面 "
    }, {
    "id": 11,
    "url": "/%E9%98%BF%E9%87%8Clanding%E6%9C%89%E6%84%9F/",
    "title": "杂谈 | 入职阿里2个月有感",
    "body": "2020/08/30 -  没有人是自成一体、与世隔绝的孤岛，每一个人都是广袤大陆的一部分。如果海浪冲掉了一块岩石，欧洲就减少；如同一个海岬失掉一角，如同你的朋友或者你自己的领地失掉一块。每个人的死亡都是我的哀伤，因为我是人类的一员。所以，不要问丧钟为谁而鸣，它就为你而鸣！ 入职阿里两个月了，先谈谈这两个月自己收获了些什么吧： 技术相关：:  懂得了如何在发生故障的时候，快速想到使用什么工具去排查问题，当某个地方报警的时候及时想起上下游 懂得了如何利用好公司的工具来处理tickets，快速处理这些霸占时间的琐碎事情 懂得了冗余一定会出现数据不一致性，两份数据的时候，数据不一致性是一个非常棘手的问题。 懂得了@Async这个注解会创建子线程，且异常不会被捕获的坑 懂得了@Transactional的传递性是怎么进行的，该在哪一层加这个注解是最合理的，当含有子线程的时候还能否保证事务一致性（不能）。 懂得了@Cacheable注解缓存内部调用失效的解决办法 由于retry用到了aspect增强，所有会有aspect的坑，就是方法内部调用，会使aspect增强失效，那么retry当然也会失效。– 自我注入 日志永远是排查问题的好帮手，首先要有打日志的意识，关键信息（业务）、堆栈信息，以便在发生异常的时候问题的排查，其次是要在发生问题的时候精准定位到日志所在地，找到日志文件（应用日志、业务日志、中间件日志） 面向失败的设计，面向失败写的代码，如何减少防御代码（流入时对其合法性校验、过程中业务校验、最后底部依赖时再对其他系统返回值校验，一旦失败以打日志+异常的形式抛出）。常见的有，调用超时要考虑到（限流、网络抖动、对方服务不稳定），导致本次请求失败了，非常严重，该解耦要解耦，该补偿的要补偿（定时任务补偿、消息补偿、重试补偿）方法论相关:  ALPD课程实践学习，体验了ES-&gt;SBE-&gt;每一个边界都是交互-&gt;交互过程中建模-&gt;建模是探索和发现的过程（业务探讨&gt;技术）-&gt;DDD代码架构。测试先行，TDD-&gt;BDD的一个常识 研发效能36计，SCRUM开发，敏捷跨界，结合ALPD课程，奠定了一个项目管理+建模+敏捷教练的职业发展方向，在调研中。 《金字塔原理》- 在书面表达和口头表达的时候，让自己的观点更简洁明了，同时也是一个思考工具，思考别人的观点是否站得住脚，是否有依据，SCQ大法。 《GETING THINGS DONE》精力管理，将大部分事情外包给list，交给工具去管理而不是占据大脑。阿里成长相关:  仰望星空，脚踏实地。在埋头做事的同时要抬头看路，什么是思考？定义问题的能力就是思考，当你不能很好的表达一件事情的时候，证明你的思考度不够。 “OWNER意识”、”业务sense”以前总不懂这些阿里土话到底是什么意思，但是我现在逐渐有点明白了，其实很多事情，换个角度看待，换个思维去想，就是另一番感觉和天地。 如果说你的目标是更远的，p9?p10？那么3. 25几乎就是必经之路了，又何必在意是什么时候呢？甚至希望越早越好，如果扛不过去，那也成为不了阿里的leader，不能真正融入阿里。 要理解清楚全球之间的差异、国家之间的差异、种族之间的差异、不同文化之间的差异、公司之间的差异、部门之间的差异、领导之间的差异，没有什么是亘古不变的，唯有充分认识到差异并合理的求同存异，才能在各种情况下坚守，只有先坚守住了，才有可能拓展，外拓的可能性。 既然接受了阿里给予的大礼包，那就不能只想着享受着阿里的福利、平台，却一直抱怨着各种不满的地方。"
    }, {
    "id": 12,
    "url": "/%E5%B7%B4%E8%90%A8%E8%BE%93%E7%90%83%E6%9C%89%E6%84%9F/",
    "title": "杂谈 | 花有重开日，人无再少年",
    "body": "2020/08/15 - 巴萨去年遭逆转，今年四大皆空，让我对这支当初因为梅西而喜欢上的球队感到很无力，虽然我已经很久没有正经熬夜看过巴萨踢球了，上一次看还是联赛关键场次，结果输了，最后丢了联赛的冠军。这一次看，抱着一丝丝希望，输少当赢的心态去看球，结果2-8，像极了阿根廷的世界杯。两支都是曾经的王者，如今暂时性落幕，世界在不断发生着变化，许多领域都悄然的发生着新事物的兴起，那些跟不上时代节奏的终究是熬不过自己的命运。  欧冠-惨案！拜仁8-2狂胜巴萨！莱万传射梅西中柱 世界杯、NBA、LPL、LCK、西甲、梦幻西游的武神坛等等，这些我曾经附着着深厚情感的赛事，都有着自己的立场追求，但是这都告诉了我没有什么是永恒不变的，我发现虽然我历史不好，对古时朝代更替，每一个朝代的兴衰没有太多的体感，但是其实这些赛事带给我的感觉跟那种感觉是一致的，都有一种花有重开日，人无再少年的那种惋惜感。我们每个人都将自己的青春投身于某一样东西当中，有的投身于家庭、有的投身于事业、有的投身于各种竞逐之中，但到最后真正能急流勇退，深藏功与名的又有几个呢？最后大多都是惶惶的走下了神坛，比如说不属于我这个时代的张朝阳，门户互联网时代的他多么的妖娆，现如今还是只能看着字节这样年轻有活力的公司拨弄着浪潮。竞技场上的梅西、C罗、小罗、马龙、FAKER、厂长、小虎等，他们都在让位于年轻一辈的人，都经历或将经历低谷而离开那个光辉的舞台。所以他们又能改变得了什么呢？任凭自己再强，却熬不过岁月，熬过了岁月，却熬不过教练团队、管理团队的决策。所以很多时候，真的很难有人能做到大刀阔斧，稳中前进，始终如一，不断演进。 这让我不禁想起了马老师，感觉也算是急流勇退了，或许是因为他真的想去做慈善公益等自己的事情，或许也是因为他明白未来是属于年轻人的，他已经很难跟自己内心对抗去做出勇敢的决定了（阿里巴巴、蚂蚁、阿里云这些杰作，真的很厉害了）。一个家，一个企业，一支球队等等，决策者太关键了，他们要敢于作出跟自己过去认知不匹配的决策，敢于跟过去自己成功的经验说不，敢于听取外部的声音，不然的话，又会糟蹋多少的奇才呢？巴萨买了那么多明星，又怎么样了呢？格子、库尼迪奥都是如此，没有体系化的决策运营，终究还是错付了。 所以，对于个人来说，很多时候真的没有太多的选择可选，唯一能够做的就是在有限的选择试错成本当中不断找到自己的阶梯，向上，不要让自己的青春错付，不断切换，不管调整，去了解这个时代的变化，去接纳这种变化，然后再不断科学的向前。 "
    }, {
    "id": 13,
    "url": "/%E5%90%8E%E6%B5%AA/",
    "title": "杂谈 | 向后浪致敬",
    "body": "2020/08/05 - 最近不止在一个场合被称为人们眼中羡慕的后浪，在一个个朋友圈转发的刷屏当中，“后浪”似乎成了一个别扭的标签，每当别人说我是后浪的时候，我总有一种不自然的感觉。事实上我这层后浪之后更有后浪，他们更汹涌，更精彩，而我同样也不免夹杂了对他们的羡慕。 在我看来，我是认可《后浪》中所说的大部分情况的。虽然我并没有如视频中的人一样，有着各种丰富的爱好和技能，但是在田地中嬉戏、水渠里捞鱼抓虾，在黑网吧里和小伙伴玩着网络游戏就等同于他们玩的滑板、玩的摄影、玩的古筝了吧？ 其实换作以前，我也是会非常认同大部分网友的观点的，后浪都要忙于生计、后浪在城中村中租着房子、后浪在送外卖、后浪在…自从我认识了Zack之后，我觉得生活不只是这样，谁能想到2010年3g手机刚刚普及的时候，2020年的现在我们已经可以在畅想5g的应用场景了？谁能想到过去我们学习只能通过课堂学习，而今网上知识教程已经是触手可及了？时代在不断的变化，这让得我们每一个人都有无限的可能性，只要我们理智判断，勇敢抉择，很多事情都会得到改变。 举一个例子：  特朗普反对全球化并且要把制造业移回美国能否成功？ - 张抗抗的回答 - 知乎 不管这个是一个段子还是一个事实，我觉得肯定有这样的事情存在，而且以后应该会越来越多。 最后用一段后浪中的话结尾吧，但愿下一次被称为后浪的时候，能够更加的坦然，成为真正的后浪，而不是徒有年龄的假后浪。 人类积攒了几千年的财富所有的知识、见识、智慧和艺术像是专门为你们准备的礼物科技繁荣 文化繁茂 城市繁华现代文明的成果 被层层打开可以尽情享用public class Main{  public void main(String[] arr){    return null;  }}"
    }, {
    "id": 14,
    "url": "/%E6%98%A5%E6%8B%9B%E6%83%B3%E8%AF%B4%E4%B8%8B/",
    "title": "杂谈 | 关于校招我想跟你说的话（下）",
    "body": "2020/08/04 -  怎么做笔试？ 怎么准备真正的面试？ 怎么平衡学习和面试时间？在上一篇我跟大家分享了一些面试过程中的前期准备，算得上是一些软技能相关的吧，虽然不是那么的重要，但是做好了也算能加分吧。这篇文章再从短期策略和长期策略两个角度来给大家介绍一下笔者是怎么准备笔试和面试的吧，说到底，还是得自己的硬实力搞上去。怎么做笔试？: 对于校招生甚至大多数社招的候选人来说，算法能力可以说是至关重要的一环了，但是罗马不是一天建成的，不要抱有侥幸心理，也不需要所有的算法都面面俱到。 短期来看：如果你猛然发现你的算法能力比较缺乏，或者说你不知道以下一些概念和问题：  各基本数据结构的概念以及时间复杂度和空间复杂度，以及基本排序算法 链表的翻转、判断交叉链表有无环、链表翻转 k 个节点等链表的题目 经典的深度搜索、广度搜索、利用栈和队列去解决一些算法问题 每一种题目所想到的暴力解法能够手写出来上面几个问题只是笔者随便说列举的几个点，倘若你对这个完全没有概念，你就需要打起精神来了，马上着手去准备算法，短期来看需要从各种类别的题目去入手，比如链表类的题目，当你做了很多之后你会发现核心的思想或许就那么几个，核心的代码就那么几行（比如说翻转一下啊、比如说用个临时变量暂存一下头结点啊）。然后到了某公司的笔试之前 ` 1 `天，去看一看往年的题目（这个真的很有帮助，有的公司的题型每一年基本是一样的，比如说第一题就是考数组，一点都不复杂，但是往往笔试的时候我们都会复杂化了许多问题，事后才晓得，多么的简单） 长期来看：你很幸运，你还有足够多的时间去做准备，你可以把这当成一个旅程，从自己感兴趣的算法题着手，慢慢建立信心，大概可以是：  手写八大基本排序 有序数组、链表的二分查找 树的遍历（递归和非递归版本） LeetCode top 100 然后按照各个类别去准备相应题目每天积累一点点，不用像短期策略那样的仓促，你可以去深入了解排序算法的演进：为什么同是时间复杂度 nlogn的算法会有那么多？他们各个的应用场景和考虑是什么？快速排序在工业中是什么样的地位，各大语言（如 python）的排序算法采用的是什么样的排序算法？ 不需要那么囫囵吞枣的去刷题，而是去了解每一种算法背后的历史和由来以及变种，或许你对编程会有新的认识。 总得来说，短期和长期准备各有各的策略，算法并不是什么很高深的东西，也并不是为了面试所以你才去看算法，而是懂得了算法之后，你会有自己新的理解，写代码的时候有下笔如有神的感觉。 或许会有人说，看了就忘了，多年不做就忘了，其实这并不影响，因为你已经提炼了你的理解了，相信下一次你再重新拾起的时候，只需要静心花费少许的时间，你又可以在编程题面前叱咤风云了，就像王国维人生三境界一样，那时工作了的你，再看，或许又有新的理解了。 准备真正的面试: 其实所谓知己知彼，百战不殆。首先自身能力要过关这是没得说的，但是这里也是有短期策略和长期策略，首先我先表明一下我个人的立场，从来都是奉行知其然，也要知其所以然。 短期来看：如果你是从来没有了解过那个领域的，你想在面试中有一定表现，那看面经或许是来得最直接的。比如说你之前对 MySQL 是一无所知的，但是你发现面试过程中数据库知识也是比较重要的一环，那你可以去看面经来快速学习快速获取知识，倘若你能铁下心来的话，选一本书快速看完，也是能取得不错的效果的。 长期来看：其实看面经只能帮你建立起你的知识索引，你真正的知识能力还是在你日常解决问题困难中体现的。每个面试官喜好不一样，笔者曾经就遇到一种情况是，有的面试官喜欢面经那种简单粗暴回答的，有的面试官喜欢你能有自己想法意见回答的。有的你回答得很冗长反而会觉得你啰嗦。其实这个跟面试的轮次以及你临场随机应变有关系。 比如说第一轮的面试官一般都是来探测你知识的广度以及浅浅的深度，有的叫做简历面，通过询问一些你简历上提到的东西来判断你的能力怎么样。所以这一面大概率你不应该回答得很详细，不应该像一个话痨在那里唠唠唠唠。但是倘若你发现你简单回答之后，面试官在那个问题上并没有停止而是继续追问，那你就要好好认真的把你对那个问题的理解和一些延伸跟面试官好好唠唠了。第二轮、第三轮面试就可以适当更多的跟面试官交谈，这一轮的面试官往往拥有更多的经验，更多的是考察你的潜力以及你性格等其他方面。所以其实这两轮面试如果你挂掉的话，其实并不能说明你不优秀，只能说明你不适合他的团队。 那么如何才能在面试过程中能够更面试官聊得来呢？这得益于你平时开发过程中的积累，倘若你遇到足够多的问题，并解决了，这就是你的谈资。 比如说 maven 包冲突这个问题，倘若你用 maven 开发过有一定复杂度或做说工作量的项目，你大概率会遇到。如果你只是背过面经，那你或许就只会说，用XX命令或者XX插件查看冲突的包，然后手动解决。你当时是怎么解决的？有没有尝试去获取更多的解决方案，为什么最终会选用了那一个解决方案，有没有别的一些思考？这就是让人觉得不一样的。 再比如说一个例子在笔者面试一家电商公司的时候谈到了分库分表，但其实我也只是理论水平，很明显就没有办法和面试官达成一种灵魂上的共鸣。但是在另外一次的面试中，谈到了使用Redis中setnx+ expire来实现分布式缓存功能，这样直接用是不能保证原子性的，但要怎么做才能保证原子性呢？当时我就 balala 了一种在 java 层面比较繁琐的方式来实现原子性。但是面试官很 nice 的笑着说，你可以回去查一下Redis本身是有什么机制或者说新的解决方案去解决这个问题。开发人员所遇到的相同坑，往往总是能引起共鸣的，只有当我们真的有过切身体会并自己有自己的思考之后，你就会能跟面试官有交流了。 最后再说一说如何知己知彼，百战不殆。这是一个通用的策略，短期来看就是快速适应面试节奏锻炼表达能力，长期来看就是多跟别人分享交流自己的技术心得。那就是找到队友，进行模拟面试 当我跟我的小伙伴相互问过一些常见的问题之后，你就会发现，至少对同一个问题，每个人的回答思路都是不一样的，比如说简单介绍一下 HashMap这么一个问到烂的问题。如果你能跟别人模拟面试，你就能发现原来这个类还有你那么多不知道的历史，甚至有一个小伙伴把论文论证结果都跟我说了，我真的觉得惊奇，或许论文结果并不能帮助我们写出更好的代码，但是那种求知探索的精神真的是让人钦佩。 所以我可以说一下我的感受，那就是作为一个像我这种水平面试官，其实候选人 balala 说些什么我根本很难听进去，特别是那种一问一答很尴尬的那种，也就是说你在面试过程中说的 80% 的话，真正能完全吸收或者说 get 到你意思的面试官 要么是常年在一线面试的面试官并且有记录有反思，早就对各种各样的回答烂熟于心了的人，要么就是你和他拥有这相同的经历，你们说话就好像一个人一样，那么的契合。否则的话，整个面试过程中，面试官听你讲话，就好像一个没有感情的机器一样在记录，在裂缝中找优点以及缺点一样。所以我得出来的结论就是，在你的实力能胜任那份工作的前提下，大部分面试还是要看你所遇到的面试官水平以及你们的共同性有多大，越大你通过的几率就越高。这也是为什么那么多觉得自己很厉害却没有得到自己理想成绩，而那些看似愚钝的却有很好的结果的原因吧。 所以我给大家长期策略的建议就是，遇到的每一个困难，都去看看别的解决方案，然后使用那一个符合你自己场景的方案。因为世界上 99%你所遇到的问题，都有人遇到过，即使不是完全相同，但也高度相似，学会搜索，学会找到那个能给你 eureka momentnet的人，也是一种能力。 平衡面试与学习时间: 这可以说是大部分人都难以处理好的问题，因为都是第一次面试，都没有体验过，或者说我们都挺在乎我们的结果的。 我询问过我身边的大部分好朋友，在找工作的时候，以下的状况可以说是正常得不能再正常了：  莫名其妙的不想吃饭以及深夜睡不着，但是决定结束找工作之后就好了 笔试后废半天，面试后废半天，评测后废半天，投简历后废半天 收到下一面通知后激动半天，收到拒信后颓半天，hr 挂了之后怀疑人生 看到身边的人拿到 offer 之后更紧张的感觉所以其实这一部分基本上是无解的，倘若让我再来一次这个过程，或者说以后工作若干年之后重新再找工作，我还是会面临相同的困境和问题，因为这是一个人正常的表现，我们应该去接纳我们自己身上的一切情绪和变化，有的人能处理的很好，有的人就像我一样很难应对，处理不好的只能在平时多努力，坚持长期主义，然后在关键时刻就可以宽容自己，该放松就放松，该接纳就接纳~ 以我目前的能力，我没有办法给到更加科学的建议，因为我知道，真的很难去处理这种情况，笔试之后大脑的抽空感，接二连三的快笔试节奏，让我们很难去静下心来学习新的知识。每一次面试之后那种兴奋与失落以及舌干唇燥的感觉，不是说应对就能应对的。 但是或许像斯多葛一样：  总是设想最坏的情形，假设一切都已被命运夺走 控制能控制的，无法控制的要放手 对抗命运对未来的安排，但接受已成现实的过去与现在，仿佛他就是宿命 克己 反思不断记录、不断反馈小幅修正，在下个战场（秋招、社招）上厮杀拼搏。 希望所有付出努力的人儿都能收获你们应得的果实吧。 后话下一篇文章或许是一个系列的文章了，当我看到那些一个个跟我相似年纪或者比我年长的人走过他们普通的人生，看着他们一篇篇博文，就好像看到了自己以后的人生轨迹，总是内心感慨万千，或许我会把他博客所写的经历和人生写成一篇篇文章吧。 如果你跟我也有相同的想法或者感慨，不妨可以跟我一起交流分享下你所看到的互联网下坚持以日记的形式公开分享总结他们的人生总结 或许你本身就是一个长期记录自己生活的人，想跟我分享你的人生见闻，也可以跟我联系。 "
    }, {
    "id": 15,
    "url": "/%E6%98%A5%E6%8B%9B%E6%83%B3%E8%AF%B4%E4%B8%8A/",
    "title": "杂谈 | 关于校招我想跟你说的话（上）",
    "body": "2020/08/03 - 这两天帮着团队找实习生，为他们解答一些疑惑过程中，深有感触，仿佛看到了去年的自己。很多方面都是赶鸭子上架，硬来一次次的反馈修正反馈修正然后度过了春招。所以记录一下在整个过程中遇到的一些问题以及心得吧。 确定方向: 一鼓作气，再而衰，三而竭。 关于确定方向，大家都很举措不定了，大多数人都没有一个坚定的目标，很多都是看着别人考研了他就决定考研，看着别人做开发了他也做开发，看着别人不着急他也不着急，但生活的本质就是如此，谁又能说自己所做的一切都没有受到别人的影响呢？ 但是在有限的时间内我们要决定好考研还是工作，考公还是工作，要不要实习？该做算法还是做开发？我觉得不妨静下心来写在纸上，问自己以下几个问题：  考研的目的是什么，为了一份更好的工作，为了学历上的提升，为了学术还是或者其他？ 考公的目的又是什么，为了一份安稳的生活，为了服务人民，为了离家近，为了父母的意愿还是其他？ 要不要实习？实习能给你带来什么优势？实习会让你失去什么？ 是做算法还是做开发？喜欢算法什么？是因为看起来体面才做算法？当你把这一切问题都写下来之后，看似乱糟糟的生活、看似许多的选择或许变得没那么模糊了。但是无论你做什么选择，其实都不一定是最优的。我有一个好朋友跟我说过这样一句话：很多问题当时你都没有办法解决，但是许多年后你回头一看，其实还有更好的方案，只是当时太年轻没能想到罢 所以，关于这一部分，每个人都有每个人自身的情况，没有一个绝对的标准，每一个选择都有相应的风险，你根据自身判断找到那个最适合自己的选择就好了，一旦选择了，那就不要犹豫和怀疑自己，一步一步向前推进就好了。考公也好，考研也罢，甚至对于找实习来说，最重要的还是要自己持续不断的前进，让自己的生活因为选择而变得有朝气。 简历准备: 打铁还需自身硬。 关于这一部分，其实很多人都没有意识到一个很严重的问题就是，他觉得自己很差劲，没有亮点。虽然你意识到这个问题了，但是当你既然选择要投简历了，那就好好的不断问自己，找出自己的亮点，而不是用一个小时就草草像填空一样完事就可以了。投出去的简历，就是自己的门面，要想获得更多的青睐，你就要像你对待自己的宝贝一样去打磨他，一版又一版的修改，一点点去不断完善，你的简历就跟你的人一样，是在一直学习新东西，一直进步。甚至乎，你今天弄懂了设计模式中的观察者模式你就可以马上加到你简历上了。 对于技术简历模板，我建议你可以使用超级简历这样一个平台去填写，简洁简单，当然你也可以选用 word，但是无论怎么样我们要学会用机器去帮我解决问题。比如说常见的语法错误，我们的专有名词有没有大小写统一，都可以用只能提示来检测，减少人工耗费的时间。 我曾经投递过的简历，被拒绝，对方还很 nice 的告诉了我用STAR法则来进行修改，其实当时真的不懂，以为这个法则就真的只是情境(situation)、任务(task)、行动(action)、结果(result)这简单的四项。现在我明白了，其实每一项都有相应的关键词去突出。 比如下面一段话（来自某个同学的教科书级别的简历）：  本人负责了XXX的设计以及XXX的接口设计。使用XXX实现XXX执行的功能，并在XX基础上通过xxx完成XX及展示。使用线程池+异步的方式来优化了xxx的性能问题。 通过一些关键的词语来凸显出场景，一些常用的表达语更直接、简明、舒服让人获取信息。 最后我还是想说在我实习的时候内推一百多（还是两百多忘了）份秋招简历之后，我觉得一个候选人要是能做到以下几点，不管他的真实实力如何，在面试这个层面来说，他已经领先于许多人了：  简历文件标题格式清楚明了，符合内推公司所要求的的格式如（姓名+职位+电话） – 过滤 10% 的人 简历中的标点符号、专业名词、文字错误、句法通顺 – 过滤 20% 的人 项目经历、工作经历描述按照STAR法则进行组织，会用粗体标识突出重点，简洁明了不冗杂 – 过滤 50% 的人 在简历中尽量体现专业知识，在发送简历到内推人邮箱中准备一段自我评价的话。 – 不过滤人哈哈哈这里并没有具体告诉你去怎么写你简历中的每一个字，但是已经算是有一个初步的方向了，希望你不要因为你的粗心而失去一个可能改变你人生轨迹的工作机会，多用一点心，总是好的。 如何投简历: 你永远想不到做评测竟然是你春招过程中花时间花得跟笔试差不多多的一环。 关于投简历，这个真的是每个人有每个人的心得，但是总的来说还是跟你所定的目标和策略有关系。比如说我当时定下的策略就是我一定要去实习，所以我一定要找到保底的 offer 和希望有一个不错的 offer。 所以我选择的策略就是拉钩+实习僧 app找学校附近的暑期实习，搜索的关键字是：后台开发、后端实习、JAVA 实习等等，然后投简历，这种一般就是线下邀约面试，面试难度一般，更多的是手写几道算法以及聊一聊项目和基础问题。接下来就是主线任务了，那就是内推+网申，我在投了几家公司之后做了一些以下的改变：  准备了2段自我介绍的话 100 来字，分别侧重于技术和性格。（介绍一些生活爱好、技术、学习成绩、自我评价） 为我的简历开始编号版本，不再依赖创建时间，而是直接在简历名称上xxx_后台开发_2020_v4. pdf，加上一个版本标识符，当然了发给内推人的时候就得去掉 准备了个人的生活照片以及证件照电子版各一张（压缩和非压缩） 统一了发送内推邮件的模板，XX师兄你好，我是XXX. . 类似这样 将个人的常用信息如身份证、专业、专业排名、四级证书、六级证书电子版保存到一个文件夹里面。（注意防护） 在 google 浏览器中创建了一个书签夹，收藏各家公司的网申完成的那个页面的地址，并每2天主动以及被动更新，命名规则为。   [状态]+[公司] 笔试过-网易互娱 3. 19笔试-网易有道 一面完成-微众 三面挂-腾讯 hr挂-XXX  关于信息填写，可以自己先准备一些常用信息，然后复制黏贴，也可以用牛客网简历填写助手，是一个插件（支持一些主流网申公司）。  当你网申了许许多多的公司之后，你会发现各种各样的简历填写系统，有好用的，有难用的。不，不对，没有好用的，都起码要耗上你 10 分钟。 所以，集中时间网申又是一个很关键的点了，我会在每天晚上 9 点后学习一段时间后或者笔试后就开始填写个人信息，做评测。不管怎么样，要学会分配自己的时间，不能碎片化了自己的学习时间，因为尽管在面试，但课还得上，知识还得学习和巩固的啊~ 好了，也是一些碎碎念，总之要有耐心，尽量流程化一些东西，让你做的每一个行为都低成本，因为面试面试，说到底还是自己的实力，最重要的还是要不断学习反馈。 就先讲这么多吧，下次再来唠唠:  怎么做笔试？ 怎么准备真正的面试？ 怎么平衡学习和面试时间？ "
    }];

var idx = lunr(function () {
    this.ref('id')
    this.field('title')
    this.field('body')

    documents.forEach(function (doc) {
        this.add(doc)
    }, this)
});
function lunr_search(term) {
    document.getElementById('lunrsearchresults').innerHTML = '<ul></ul>';
    if(term) {
        document.getElementById('lunrsearchresults').innerHTML = "<p>Search results for '" + term + "'</p>" + document.getElementById('lunrsearchresults').innerHTML;
        //put results on the screen.
        var results = idx.search(term);
        if(results.length>0){
            //console.log(idx.search(term));
            //if results
            for (var i = 0; i < results.length; i++) {
                // more statements
                var ref = results[i]['ref'];
                var url = documents[ref]['url'];
                var title = documents[ref]['title'];
                var body = documents[ref]['body'].substring(0,160)+'...';
                document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML + "<li class='lunrsearchresult'><a href='" + url + "'><span class='title'>" + title + "</span><span class='body'>"+ body +"</span><span class='url'>"+ url +"</span></a></li>";
            }
        } else {
            document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = "<li class='lunrsearchresult'>No results found...</li>";
        }
    }
    return false;
}

function lunr_search(term) {
    $('#lunrsearchresults').show( 400 );
    $( "body" ).addClass( "modal-open" );
    
    document.getElementById('lunrsearchresults').innerHTML = '<div id="resultsmodal" class="modal fade show d-block"  tabindex="-1" role="dialog" aria-labelledby="resultsmodal"> <div class="modal-dialog shadow" role="document"> <div class="modal-content"> <div class="modal-header" id="modtit"> <button type="button" class="close" id="btnx" data-dismiss="modal" aria-label="Close"> &times; </button> </div> <div class="modal-body"> <ul class="mb-0"> </ul>    </div> <div class="modal-footer"><button id="btnx" type="button" class="btn btn-primary btn-sm" data-dismiss="modal">Close</button></div></div> </div></div>';
    if(term) {
        document.getElementById('modtit').innerHTML = "<h5 class='modal-title'>Search results for '" + term + "'</h5>" + document.getElementById('modtit').innerHTML;
        //put results on the screen.
        var results = idx.search(term);
        if(results.length>0){
            //console.log(idx.search(term));
            //if results
            for (var i = 0; i < results.length; i++) {
                // more statements
                var ref = results[i]['ref'];
                var url = documents[ref]['url'];
                var title = documents[ref]['title'];
                var body = documents[ref]['body'].substring(0,160)+'...';
                document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML + "<li class='lunrsearchresult'><a href='" + url + "'><span class='title'>" + title + "</span><small><span class='body'>"+ body +"</span><span class='url'>"+ url +"</span></small></a></li>";
            }
        } else {
            document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = "<li class='lunrsearchresult'>Sorry, no results found. Close & try a different search!</li>";
        }
    }
    return false;
}
    
$(function() {
    $("#lunrsearchresults").on('click', '#btnx', function () {
        $('#lunrsearchresults').hide( 5 );
        $( "body" ).removeClass( "modal-open" );
    });
});